import imgexam from '../../../assetts/icons/logo-nasykat.png';

const duaData = [
  {
    title: 'Адам алейхи саламдын дубасы',
    text: '',
    arabic:
      'رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ',
    transcription:
      'Роббана золамнаа аңфусанаа Уа иллям тагфир ланаа уа тархамнаа Ланакуунанна миналь хоосирийн',
    kyrgyz:
      'О, Роббибиз! Биз өзүбүзгө зулум кылдык. Эгер Сен бизди кечирип, ырайым кылбасаң, анда биз, – албетте, зыянга учуроочулардан болобуз!',
    images: imgexam,
  },
  {
    title: 'Юнус пайгамбардын дубасы',
    text: 'Юнус пайгамбарды кит жутуп алганда. Киттин ичинде отурган пайгамбар Аллага жалбарып, дуба кылганда, ошол апааттан кутулган.',
    arabic:
      'لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ',
    transcription:
      'Лаа илааха илла анта Субхаанака инний кунту миназ-зоолимийн.',
    kyrgyz:
      'Өзүңдөн башка (сыйынууга татыктуу Зат) жок. Сен Аруу-Тазасың! Акыйкатта, мен заалымдардан болдум!',
    images: imgexam,
  },
  {
    title: 'Закария пайгамбардын дубасы',
    text: 'Закария пайгамбардын перзенттүү болууну каалап, Аллага жалбарып кайрылган дуасы:',
    arabic:
      'رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ',
    transcription:
      'Робби хаб-лий мил-ладуңка зурриятан тойибатан иннака самиъуд-дуа',
    kyrgyz:
      'О Роббим! Мага да Өзүңдүн даргөйүңдөн пакиза бир урпак бере көр! Албетте, Сен дубаны Угуучусуң!',
    images: imgexam,
  },
  {
    title: 'Муса пайгамбардын дубасы',
    text: 'Жараткан Алла аны Фараонго жөнөтөт. Аны туура жолго чакыруу жана жамандыктан кайтаруу үчүн сөзгө чечен болушу керек эле. Мына ушул учурда Муса пайгамбар Аллага кайрылып дуа кылат.',
    arabic:
      'رَبِّ اشْرَحْ لِي صَدْرِي  وَيَسِّرْ لِي أَمْرِي  وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي  يَفْقَهُوا قَوْلِي',
    transcription:
      'Роббиш-рох лий содрий  уа яссир лий амрий  уах-лиль укдата мин лисаний  яфкоху коулий.',
    kyrgyz:
      'Оо, Роббим! Менин көкүрөгүмдү кенен кыл! Менин иштеримди жеңил кыл! Тилимдеги түйүндү чечип кой! Адамдар (сөзүмдү) түшүнчүдөй болсун!',
    images: imgexam,
  },

  {
    title: 'Кайгы - капаны кетирүү үчүн эртели - кеч окулуучу дуба',
    text: 'Азирети Абу Дардаа (разияллааху анху) мындай деп рабаят этет: «Кимде-ким эртели-кеч жети жолу ушул дубаны окуса, Алла Таала дүйнө жана акырет жөнүндөгү анын бардык кайгы-капаларын кетирет»',
    arabic:
      'حَسۡبِیَ اللّٰہُ ٭ۖ لَاۤ اِلٰہَ اِلَّا ہُوَ  عَلَیۡہِ تَوَکَّلۡتُ وَہُوَ رَبُّ الۡعَرۡشِ الۡعَظِیۡمِ',
    transcription:
      'Хасбияллааху лаа илаха илла хуу, Алейхи таваккалту ва хува раббул-аршил-азийм. (9:129)',
    kyrgyz:
      'Котормосу: Алла мага жетиштүү; Андан бөлөк эч кандай кудай жок; мен Ага гана тобокел кыламын жана Ал улуу Арштын Раббиси» («Ат-Тавба» сүрөөсү:129)',
    images: imgexam,
  },
  {
    title: 'Кыямат күнү соопторуңуз толук болуусу үчун окулуучу дуба.',
    text: 'Али Разияллооху анху айтат :Ким өзүнүнүн сооптору Кыямат күнү толук болуусун кааласа анда ушул аятты үч жолу окусун!',
    arabic: 'سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ',
    transcription:
      'Субхаана роббика роббил ъиззати ъаммааясифууна (Соффат.180)',
    kyrgyz: 'Улуу  Эгең алардын кошкон шериктеринен аруу!',
    images: imgexam,
  },
  {
    title: 'Уйку келбегенде окулуучу дуба',
    arabic:
      'اللَّهُمْ غَارَتِ النُّجُومُ وَهَدَأَتِ الْعُيُونُ وَأَنْتَ حَيٌّ قَيُّومٌ لَا تَأْخُذُكَ سِنَةٌ وَ لَا نَوْمٌ يَا حَيُّ يَا قَيُّومُ اهْدِعْ لَيْلِي وَأَنِمْ عَيْنِي. (موط مالك)',
    transcription:
      'Аллоохумма гооротин нужууму ва хада атил ъуйууну ва анта хаййун коййум. Лаа та хузука синатув валаа науум, йаа хаййу йаа коййууму, ахди лайлии ва аним ъайнии. ',
    kyrgyz:
      'Оо, Аллах! Жылдыздар көрүнбөй калды жана көздөр уйкуга киришти. Сен гана Тирүү, Түбөлүктүүсүң. Сен эч качан үргүлөбөйсүң жана уктабайсың. Оо, Тирүү жана Түбөлүктүү Зат! Сен менин түнүмдү - бейпил кыл жана мага уйку бер.',
    images: imgexam,
  },
  {
    title: 'Дин жана дүйнө жакшылыгын тилөө дубасы',
    text: 'Сүйүктүү Пайгамбарыбыз Мухаммад (саллаллааху алайхи ва саллам)дын кызматчысы Азирети Анас (разияллааху анху)дан: «Сүйүктүү Пайгамбарыбыз Мухаммад (саллаллааху алайхи ва саллам) баарынан көбүрөөк кайсы дубаны окучу?» – деп суралганда, ал (разияллааху анху) (Ташаххуддан кийин окулуучу) төмөндөгүдөй дуба экенин айткан:',
    arabic:
      'اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ',
    transcription:
      'Аллаахумма Раббанаа аатинаа фид-дуня хасанатан ва фил-аахирати хасанатан вакинаа азаабан-наар.',
    kyrgyz:
      'Эй, Алла, Биздин Раббибиз! Бизге дүйнөдө да жакшылык тартуулагын жана акыретте да, ошондой эле бизди от азабынан сактагын.',
    images: imgexam,
  },
  {
    title: 'Жеңишке жетишүү, карыздан кутулуу жана кеңири ырыскы үчүн дуба',

    arabic:
      'اللّٰہُمَّ مٰلِکَ الۡمُلۡکِ تُؤۡتِی الۡمُلۡکَ مَنۡ تَشَآءُ وَتَنۡزِعُ الۡمُلۡکَ مِمَّنۡ تَشَآءُ  وَتُعِزُّ مَنۡ تَشَآءُ وَتُذِلُّ مَنۡ تَشَآءُ  بِیَدِکَ الۡخَیۡرُ  اِنَّکَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ تُوۡلِجُ   الَّیۡلَ فِی النَّہَارِ وَتُوۡلِجُ النَّہَارَ فِی الَّیۡلِ  وَتُخۡرِجُ الۡحَیَّ مِن الۡمَیِّتِ وَتُخۡرِجُ الۡمَیِّتَ مِنَ الۡحَیِّ  وَتَرۡزُقُ مَنۡ تَشَآءُ بِغَیۡرِ حِسَابٍ',
    transcription:
      'АЛЛААХУММА МААЛИКАЛ-МУЛКИ ТУ′ТИЛ-МУЛКА МАН ТАШАААУ ВА ТАНЗИЪУЛ-МУЛКА МИММАН ТАШАААУ ВА ТУЪИЗЗУ МАН ТАШАААУ ВА ТУЗИЛЛУ МАН ТАШАААУ БИ-ЯДИКАЛ-ХАЙИР. ИННАКА АЛАА КУЛЛИ ШАЙ′ИН КАДИЙР. ТУУЛИЖУЛ-ЛАЙЛА ФИН-НАХААРИ ВА ТУУЛИЖУН-НАХААРА ФИЛ-ЛАЙИЛИ ВА ТУХРИЖУЛ-ХАЙЙА МИНАЛ-МАЙЙИТИ ВА ТУХРИЖУЛ-МАЙЙИТА МИНАЛ-ХАЙЙИ ВА ТУРЗУКУ МАН ТАШАААУ БИ-ГАЙРИ ХИСААБ.',
    kyrgyz:
      'Эй, Теңирим, падышачылык Ээси! Сен каалаганыңа бийлик бересиң жана каалаганыңдан бийликти тартып аласың. Ошондой эле Сен каалаганыңды урматтуу кыласың жана каалаганыңды кор кыласың. Бүт бардык жакшылык болгону Сенин колуңда. Албетте, Сен каалаган ар бир нерсеге дайыма кудуреттүүсүң. Сен түндү күндүзгө кийиресиң жана күндүздү түнгө кийиресиң. Ошондой эле өлүктөн тирүүнү чыгарасың жана тирүүдөн өлүктү чыгарасың. Сен каалаган кишиңе эсеп-кысапсыз ырыскы бересиң. ',
    images: imgexam,
  },
  {
    title: 'Жүрөктүн тынчтыгы жана иштин жеңилдиги үчүн',
    text: 'Кайсыл бир иште жүрөк тынч болбой жатса, же окуучу сабагын түшүнө албай жатса, анда бул дубаны окусун:',
    arabic:
      'ربِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَ احْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي.',
    transcription:
      'Роббиш рохлии содрии, уа йассир лии амрии. Уахлул ъукдатам мил лисаании, Йафкохуу коулии. (Тоха 24.25.27.28)',
    kyrgyz:
      'Оо, Робби! Менин дилимди кенен жана ишимди жеңил кыл. Оо, Робби! Адамдардын менин сөзүмдү түшүнүүсү үчүн тилимден түйүндү чечкин.',
    images: imgexam,
  },
  {
    title: 'Таңда жана кечте 100 жолу окулса',
    text: 'Таңда жана кечте 100 жолу окулса бардык күнөөлөр кечириле турчу таспих:',
    arabic: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيمِ',
    transcription: 'Субханаллахи ва би-хамдихи, субханаллахил азим',
    kyrgyz:
      'Кемал сыфаттар менен сыпаттанган жана кемчилик сыпаттардан бери болгон Аллахты хамд менен таспих кылам.',
    images: imgexam,
  },
  {
    title: 'Намазда таспихтерди тарткандан кийин',
    text: 'дубага колдорду көтөрүп жатканда окулганда күнөөлөр кечириле турган дуа:',
    arabic:
      'لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
    transcription:
      'Лаа илаха иллаллаху вахдаху ла шерике лех лахулмулку ва лахулхамду ва хува ала кулли шейин кадир',
    kyrgyz:
      'Аллахтан башка илах жок. Ибадатка ылайык жалгыз Аллах, Ал бир, ортогу жок, аалам Анын мүлкү, хамд Ага тийиштүү, ал баарына кадыр.',
    images: imgexam,
  },
  {
    title: 'Кыйынчылыктардан кутулуу',
    text: 'Кыйынчылыктардан кутулуу үчүн окулган калима-и тамжид:',
    arabic: 'لا حول ولا قوة الا بالله العلي العظيم',
    transcription: 'Ла хавла вала куввата илла биллахилалиййилазим',
    kyrgyz:
      'Аллахтан башка күч ээси жок. Бардыгына кубат жана күч берген бир гана затий жана субутий сыфаттардын ээси улук Аллах.',
    images: imgexam,
  },
  {
    title: 'Коркуу жана балээлерден кутулуу ',
    text: 'Коркуу жана балээлерден кутулуу үчүн таңда жана кечте үч жолу окулган дуба:',
    arabic:
      'بِسْمِ اللهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ، وَهُوَ السَّمِيعُ العَلِيم ',
    transcription:
      'БисмиЛляхи ллязи ля ядурру маасмихи шайун филь арды ва ля фи ссамаи ва хува Ссамиуль Алим',
    kyrgyz:
      'Аллахтын улук ысымына сыйынганга жерде жана көктө эч бир нерсе зыян бере албайт, Ал бардыгын угат жана билет.',
    images: imgexam,
  },
  {
    title: 'Эртең менен жана кечинде окулуу керек болгон истигфар:',
    text: 'Муну күндө эртең менен окуган адам кечке чейин, кечинде окуган эртең мененкиге чейин өлө турган болсо шейит болот',
    arabic:
      'للّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ',
    transcription:
      'Аллахумма энте рабби лаилахе илла энте халактени ва эне абдуке ва эне ала ахдике ва вадике местетату эузу бике мин шерри ма санату эбуу леке би-ниметике алеййе ва эбуу би зенби фагфирли ла йагфируззунубе илла энте. Ла илахе илла энте субханеке инни кунту минез залимин',
    kyrgyz:
      'Аллахым, Сен менин Раббимсиң, Сенден башка мабуд жок, бир гана Сен барсың, мени жоктон жараткан Сенсиң жана мен Сенин кулуңмун, күчүмдүн жетишинче Сага берген ахдымда жана сөзүмдө турам, кылган жаман нерселеримдин зыянынан Сага баш калкалайм, мага болгон ниматтарыңды жана күнөөлөрүмдү моюндаймын, менин күнөөлөрүмдү кечир, себеби, Сенден башка багыштоочу жок. Сенден башка эч бир илах жок, Сени бардык кемчиликтерден танзих кыламын. Чындыгында мен напсиме акысыздык кылгандарданмын.',
    images: imgexam,
  },
  {
    title: 'Динде бекем болуу',
    text: 'Динде бекем туруп, акыркы демде ыйман менен өлүү үчүн:',
    arabic: 'يا مقلب القلوب ثبت قلبي على دينك',
    transcription: 'Я мукаллиба-ль-кулюби, саббит кальби ‘аля дини-ка',
    kyrgyz:
      'Эй улук Аллахым, көңүлдөрү жакшыдан жаманга, жамандан жакшыга бурган бир гана Сенсиң. Көңүлүмдү дининде бекем кыл, дининен кайтарба, Мусулмандыктан айырба!',
    images: imgexam,
  },
  {
    title: 'Ар түрдүү зыяндардан коргонуу үчүн',
    text: 'Назардан жана ар түрдүү зыяндардан коргонуу үчүн окулган дуба:',
    arabic: 'أعوذ بكلمات الله التامات من شر ما خلق',
    transcription: 'А‘узу бикалимати Лляхи т-таммати мин шарри ма халяк.',
    kyrgyz:
      'Бардык жаратылгандардын зыянынан Аллахтын кемчиликсиз сөздөрүнө калкаланам.',
    images: imgexam,
  },
  {
    title: 'Көз тийгенге окулган дуба:',
    text: 'Бул дуба күн сайын таңда жана кечте үч жолу окулуп өзүнүн үстүнө үйлөнсө көз тийүүдөн жана шайтандардын жана да айбанаттардын зыяндарынан корголот.',
    arabic:
      'أعوذ بِكَلِمَاتِ اللهِ التَّامَّةِ مِن كُلِّ شَيطَانٍ وَهَامَّة ، وَمِن كُلِّ عَينٍ لَامَّة',
    transcription:
      'А‘узу бикалимати Лляхи т-таммати мин кулли шайтанин ва хамматин ва мин кулли ‘айнин лямматин.',
    kyrgyz:
      'Шайтандардын, жаныбарлардын жана кем көздөрдүн зыянынан Аллахтын кемчиликсиз сөздөрүнө калкаланам.',
    images: imgexam,
  },
  {
    title: ' Үй-бүлөсү жана балдарынын бактылуулугун тилеген дуба',
    text: 'Ким аялы жана балдарынын бактылуулугун жана ортодогу мамилелеринин жакшылыгын кааласа, төмөнкү дубаны окуп жүрсүн:',
    arabic:
      'رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا',
    transcription:
      'Роббанаа хабланаа мин азваажинаа, ва зуррий йаатинаа, куррота ьайун. Важ-ьалнаа лил муттакиина имаамаа". (Фуркан сүрөсү, 74-аят)',
    kyrgyz:
      'Мааниси: Оо, биздин Робб! Бизге күйөөлөрүбүз, аялдарыбыз жана балдарыбыз аркылуу көздүн ырахатын бер жана бизди такыбаларга башчы кыл.',
    images: imgexam,
  },
  {
    title: 'Ата-энеге жакшылык каалоо',
    text: 'Ата-эне үчүн (тирүү болсун, же көз жумган болсун) Куранда бул дуба айтылган:',
    arabic: 'رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا',
    transcription: 'Роббирхам хумаа камаа роббаййаании сагиироо',
    kyrgyz: 'Оо, Роббим! Мени кичинемден багып-өстүргөн ата-энеме ырайым кыл.',
    images: imgexam,
  },
  {
    title: 'Жаңы иш баштоо',
    text: 'Же жаңы жерге киргенде окулуучу дуба',
    arabic:
      'رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا',
    transcription:
      '"Робби адхилнии мудхола сидкин. Ва ахрижнии мухрожа сидкин. Важ-ьал лии милладуңка султоонан насиироо',
    kyrgyz:
      'Оо, Робб! Мага туура кирүүгө жана туура чыгууга жардам бер. Мага өзгөчө Өзүң тараптан жардам берүүчү күч-кубат бер.',
    images: imgexam,
  },
];

export default duaData;
