import imgexam from '../../../assetts/images/islam/AllahuAkbar.avif';

const duaData = [
  {
    title: 'КАЙГЫ - КАПАНЫ КЕТИРУУ ҮЧҮН ЭРТЕЛИ - КЕЧ ОКУЛУУЧУ ДУБА',
    text: 'Азирети Абу Дардаа (разияллааху анху) мындай деп рабаят этет: «Кимде-ким эртели-кеч жети жолу ушул дубаны окуса, Алла Таала дүйнө жана акырет жөнүндөгү анын бардык кайгы-капаларын кетирет»',
    arabic:
      'حَسۡبِیَ اللّٰہُ ٭ۖ لَاۤ اِلٰہَ اِلَّا ہُوَ  عَلَیۡہِ تَوَکَّلۡتُ وَہُوَ رَبُّ الۡعَرۡشِ الۡعَظِیۡمِ',
    transcription:
      'ХАСБИЯЛЛААХУ ЛАА ИЛААХА ИЛЛАА ХУУ, АЛАЙХИ ТАВАККАЛТУ ВА ХУВА РАББУЛ-АРШИЛ-АЗИЙМ. (9:129)',
    kyrgyz:
      'Котормосу: Алла мага жетиштүү; Андан бөлөк эч кандай кудай жок; мен Ага гана тобокел кыламын жана Ал улуу Арштын Раббиси» («Ат-Тавба» сүрөөсү:129)',
    images: imgexam,
  },
  {
    title: 'КЫЯМАТ КҮНҮ СООПТОРУҢУЗ ТОЛУК БОЛУУСУ ҮЧҮН ОКУЛУУЧУ ДУБА.',
    text: 'Али Разияллооху анху айтат :Ким өзүнүнүн сооптору Кыямат күнү толук болуусун кааласа анда ушул аятты үч жолу окусун!',
    arabic: 'سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ',
    transcription:
      'Субхаана роббика роббил ъиззати ъаммааясифууна (Соффат.180)',
    kyrgyz: 'Улуу  Эгең алардын кошкон шериктеринен аруу!',
    images: imgexam,
  },
  {
    title: 'Уйку келбегенде окулуучу дуба',
    arabic:
      'اللَّهُمْ غَارَتِ النُّجُومُ وَهَدَأَتِ الْعُيُونُ وَأَنْتَ حَيٌّ قَيُّومٌ لَا تَأْخُذُكَ سِنَةٌ وَ لَا نَوْمٌ يَا حَيُّ يَا قَيُّومُ اهْدِعْ لَيْلِي وَأَنِمْ عَيْنِي. (موط مالك)',
    transcription:
      'Аллоохумма гооротин нужууму ва хада атил ъуйууну ва анта хаййун коййум. Лаа та хузука синатув валаа науум, йаа хаййу йаа коййууму, ахди лайлии ва аним ъайнии. ',
    kyrgyz:
      'Оо, Аллах! Жылдыздар көрүнбөй калды жана көздөр уйкуга киришти. Сен гана Тирүү, Түбөлүктүүсүң. Сен эч качан үргүлөбөйсүң жана уктабайсың. Оо, Тирүү жана Түбөлүктүү Зат! Сен менин түнүмдү - бейпил кыл жана мага уйку бер.',
    images: imgexam,
  },
  {
    title: 'Дин жана дүйнө жакшылыгын тилөө дубасы',
    text: 'Сүйүктүү Пайгамбарыбыз Мухаммад (саллаллааху алайхи ва саллам)дын кызматчысы Азирети Анас (разияллааху анху)дан: «Сүйүктүү Пайгамбарыбыз Мухаммад (саллаллааху алайхи ва саллам) баарынан көбүрөөк кайсы дубаны окучу?» – деп суралганда, ал (разияллааху анху) (Ташаххуддан кийин окулуучу) төмөндөгүдөй дуба экенин айткан:',
    arabic:
      'اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ',
    transcription:
      'Аллаахумма Раббанаа аатинаа фид-дуня хасанатан ва фил-аахирати хасанатан вакинаа азаабан-наар.',
    kyrgyz:
      'Эй, Алла, Биздин Раббибиз! Бизге дүйнөдө да жакшылык тартуулагын жана акыретте да, ошондой эле бизди от азабынан сактагын.',
    images: imgexam,
  },
  {
    title: 'Жеңишке жетишүү, карыздан кутулуу жана кеңири ырыскы үчүн дуба',

    arabic:
      'اللّٰہُمَّ مٰلِکَ الۡمُلۡکِ تُؤۡتِی الۡمُلۡکَ مَنۡ تَشَآءُ وَتَنۡزِعُ الۡمُلۡکَ مِمَّنۡ تَشَآءُ  وَتُعِزُّ مَنۡ تَشَآءُ وَتُذِلُّ مَنۡ تَشَآءُ  بِیَدِکَ الۡخَیۡرُ  اِنَّکَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ تُوۡلِجُ   الَّیۡلَ فِی النَّہَارِ وَتُوۡلِجُ النَّہَارَ فِی الَّیۡلِ  وَتُخۡرِجُ الۡحَیَّ مِن الۡمَیِّتِ وَتُخۡرِجُ الۡمَیِّتَ مِنَ الۡحَیِّ  وَتَرۡزُقُ مَنۡ تَشَآءُ بِغَیۡرِ حِسَابٍ',
    transcription:
      'АЛЛААХУММА МААЛИКАЛ-МУЛКИ ТУ′ТИЛ-МУЛКА МАН ТАШАААУ ВА ТАНЗИЪУЛ-МУЛКА МИММАН ТАШАААУ ВА ТУЪИЗЗУ МАН ТАШАААУ ВА ТУЗИЛЛУ МАН ТАШАААУ БИ-ЯДИКАЛ-ХАЙИР. ИННАКА АЛАА КУЛЛИ ШАЙ′ИН КАДИЙР. ТУУЛИЖУЛ-ЛАЙЛА ФИН-НАХААРИ ВА ТУУЛИЖУН-НАХААРА ФИЛ-ЛАЙИЛИ ВА ТУХРИЖУЛ-ХАЙЙА МИНАЛ-МАЙЙИТИ ВА ТУХРИЖУЛ-МАЙЙИТА МИНАЛ-ХАЙЙИ ВА ТУРЗУКУ МАН ТАШАААУ БИ-ГАЙРИ ХИСААБ.',
    kyrgyz:
      'Эй, Теңирим, падышачылык Ээси! Сен каалаганыңа бийлик бересиң жана каалаганыңдан бийликти тартып аласың. Ошондой эле Сен каалаганыңды урматтуу кыласың жана каалаганыңды кор кыласың. Бүт бардык жакшылык болгону Сенин колуңда. Албетте, Сен каалаган ар бир нерсеге дайыма кудуреттүүсүң. Сен түндү күндүзгө кийиресиң жана күндүздү түнгө кийиресиң. Ошондой эле өлүктөн тирүүнү чыгарасың жана тирүүдөн өлүктү чыгарасың. Сен каалаган кишиңе эсеп-кысапсыз ырыскы бересиң. ',
    images: imgexam,
  },
  {
    title: 'Жүрөктүн тынчтыгы жана иштин жеңилдиги үчүн',
    text: 'Кайсыл бир иште жүрөк тынч болбой жатса, же окуучу сабагын түшүнө албай жатса, анда бул дубаны окусун:',
    arabic:
      'ربِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَ احْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي.',
    transcription:
      'Роббиш рохлии содрии, уа йассир лии амрии. Уахлул ъукдатам мил лисаании, Йафкохуу коулии. (Тоха 24.25.27.28)',
    kyrgyz:
      'Оо, Робби! Менин дилимди кенен жана ишимди жеңил кыл. Оо, Робби! Адамдардын менин сөзүмдү түшүнүүсү үчүн тилимден түйүндү чечкин.',
    images: imgexam,
  },
];

export default duaData;
