const prayers = [
  {
    title: 'Роббана атина дубасы',
    transcription:
      'Раббана атина фид-дунья хасанатау ва филь-ахирати хасанатау ва кыйна газабаннар',
    meaning:
      'Оо, Жараткан Раббим бизге бул дүйнөнүн жана акыреттин жакшылыгын бер. Бизди тозок отунан сактагын.',
  },
  {
    title: 'Закария пайгамбардын дубасы',
    transcription:
      'Робби хаб-лий мил-ладуңка зурриятан тойибатан иннака самиъуд-дуа',
    meaning:
      'О Роббим! Мага да Өзүңдүн даргөйүңдөн пакиза бир урпак бере көр! Албетте, Сен дубаны Угуучусуң!',
  },
  {
    title: 'Уктоо алдындагы дуба',
    transcription: 'Аллаhумма ḱини ‘аҙабака явма таб’аҫу ‘ибадака',
    meaning:
      'Эй Алла! Өзүңдүн пенделериңди Кыямат Күнү кабырдан тургузган убакта мени өзүңдүн азабындан куткар!',
  },

  {
    title: 'Кыямат күнү соопторуңуз толук болуусу үчун окулуучу дуба.',
    transcription:
      'Субхаана роббика роббил ъиззати ъаммааясифууна (Соффат.180)',
    meaning: 'Улуу  Эгең алардын кошкон шериктеринен аруу!',
  },
  {
    title: 'Күзгүнү карагандагы дуба',
    transcription: 'Аллоо-хумма анта хассанта холкии фахассин хулкии.',
    meaning:
      'Эй Алла Сен мени чырайлуу кылып жараттың. Эми Сен менин мүнөзүмдү да жакшы кыл.',
  },
];

export default prayers;
