const prayers = [
  {
    title: 'Бардык жакшылыкты камтуучу дуба',
    transcription:
      'Раббанаа аатина фид-дунья хасанатан ва филь-аахирати хасанатан ва кыйнаа аъзаабаннар',
    meaning:
      'Оо, Жараткан Раббим! Бизге бул дүйнөндө жакшылык бергин жана акыретте да жакшылык бергин. жана тозок отунан сактагын.',
  },
  {
    title: 'Закария (А.C) пайгамбардын дубасы',
    transcription:
      'Робби хаб-лии мил-ладуңка зурриятан тойибатан иннака самиъуд-дуаа',
    meaning:
      'О Роббим! Мага да Өзүңдүн даргөйүңдөн пакиза бир урпак бере көр! Албетте, Сен дубаны Угуучусуң!',
  },
  {
    title: 'Уктоо алдындагы дуба',
    transcription: 'Аллаhумма ḱини ‘аҙабака явма таб’аҫу ‘ибадака',
    meaning:
      'Оо Алла! Өзүңдүн пенделериңди кабырдан тирилткен күнү мени өзүңдүн азабындан куткаргын!',
  },

  {
    title:
      'Кыямат күнү соопторуңуз толук болуусун кааласаңыз бул дубаны окуңуз.',
    transcription:
      'Субхаана роббика роббил ъиззати ъаммаа ясыфууна (Соффат 180-аят)',
    meaning: 'Улуу  Эгең алардын кошкон шериктеринен аруу!',
  },
  {
    title: 'Күзгүнү карагандагы дуба',
    transcription: 'Аллоо-хумма хассанта холкии фахассин хулукии.',
    meaning:
      'Оо Алла! Сен мени чырайлуу кылып жараттың. Эми менин кулк мүнөзүмдү да чырайлуу кыл.',
  },
];

export default prayers;
