const hadiths = [
  'Абу Дарда (Аллах андан ыраазы болсун) риваят кылган хадисте, Пайгамбарыбыз (Ага Аллахтын салам-салаваты болсун): «Илимдүү ибадат кылуучу менен илимсиз ибадат кылуучунун айырмасы, ай менен башка жылдыздардын айырмасы сыяктуу» - деген. (Тирмизий).',
  'Абу Умама (Аллах андан ыраазы болсун) риваят кылган хадисте, Пайгамбарыбыз (Ага Аллахтын салам-салаваты болсун): «Аалым менен илимсиз адам, мени менен силердин эң жөнөкөйүңөр сыяктуу» - деп айткан. (Тирмизий).',
  'Абу Дарда (Аллах андан ыраазы болсун) риваят кылган хадисте, Пайгамбарыбыз (Ага Аллахтын салам-салаваты болсун): «Илим талап кылуучуга ыраазы болгон периштелер ага канатын төшөп турушат» - деп айткан. (Абу Дауд).',
  'Абу Дарда (Аллах андан ыраазы болсун) риваят кылган хадисте, Пайгамбарыбыз (Ага Аллахтын салам-салаваты болсун): «Илим алуучуга асман-жердеги баардык жаныбарлар, уюгундагы кумурска жана суу түбүндөгү кит дагы кечирим тилеп турат» - деп айткан. (Абу Дауд).',
];

export default hadiths;
