const zaryiat55 = [
  'Аллах Таала Куранда: «Чындыгында, намаз бузукулуктан жана күнөөдөн тосот» - деп айткан. (Анкабут. 45-аят).',
  'Аллах Таала айткан: "Албетте намаз ыймандуу адамдар үчүн өз убактысында окулуучу парз болду". (Ниса, 103-аят).',
  'Аллах Таала Куранда: “Алар чыныгы динди таза, бекем кармап, бир гана Аллахка сыйынууга жана намаз окуп зекет берүүгө буюрулду” - деген. (Баййина. 5-аят).',
  'Аллах Таала: “Намаз окугула, зекет бергиле...” - деп айткан. (Бакара. 43-аят).',
  'Аллах Таала Куранда: «Оо, ыймандуулар, Жума күнү намазга азан айтылганда Аллахты эскерүүгө (намаз окууга) шашылгыла…» - деген. (Жума. 9-аят).',
  'Аллах Таала айткан: «Бирок алардын артынан намаздарын таштаган жана кумарларына ээрчиген урпактар келди. Ошондуктан алар жамандыкка кабылышат». (Марьям, 59-аят).',
  'Аллах Таала айткан: «Силерди (бул) сакарга (тозокко) эмне алып келди (дешет). Алар жооп беришет: Биз намаз окугандардан эмес элек». (Муддасир,42-аят).',
  'Аллах Таала айткан: «Вайл (тозок) болсун намазды (начар) окуучуларга. Анткени алар намаздарын унутуп коюшкан. Алар (намаздарын) эл көрсүн үчүн окушат». (Маауун, 4-5-аяттар).',
  '“Ислам беш нерсе менен негизделген: Аллахтан башка сыйынууга татыктуу зат (илах) жок, Мухаммад Анын элчиси деп күбөлүк берүү, намаз окуу, зекет берүү, ажылык кылуу жана орозо кармоо”– деп айткан.',
];

export default zaryiat55;
