const zaryiat55 = [
  'Аллах Таала Куранда мындай деген: «Чындыгында, намаз бузукулуктан жана күнөөдөн тосот». (Анкабут. 45-аят).',
  'Аллах Таала мындай деп айткан: "Албетте намаз ыймандуу адамдар үчүн өз убактысында окулуучу парз болду". (Ниса, 103-аят).',
  'Аллах Таала Куранда мындай деген: “Алар чыныгы динди таза, бекем кармап, бир гана Аллахка сыйынууга жана намаз окуп, зекет берүүгө буюрулду” (Байина. 5-аят).',
  'Аллах Таала Куранда мындай деп айткан: “Намаз окугула, зекет бергиле...” - деп айткан. (Бакара. 43-аят).',
  'Аллах Таала Куранда мындай деген: «Оо, ыймандуулар! жума күнү намазга азан айтылганда Аллахты эскерүүгө (намаз окууга) шашылгыла…» - деген. (Жума. 9-аят).',
  'Аллах Таала мындай деп айткан: «Бирок алардын артынан намаздарын таштаган жана кумарларына ээрчиген урпактар келди. алар жакында оор азапка жолугушат». (Марьям, 59-аят).',
  'Аллах Таала мындай деп айткан: «Силерди "САКАР тозогуна эмне түшүрдү?" алар айтышат: "Биз намаз окуучулардан болбодук". (Муддасир,42-аят).',
  'Аллах Таала мындай деп айткан: «Кээ бир (Намаз окуучуларга) азап тозок болсун! алар намаздарын унутуп коюшат. (Алар намазда жана башка ибадаттарда) эл көрсүн үчүн (рия) кылышат. (Мааъун, 4-6-аяттар).',
  '“Ислам беш нерсе менен негизделген: "Аллахтан башка сыйынууга татыктуу зат (илах) жок, Мухаммад c.a.в Анын кулу жана элчиси деп күбөлүк берүү", намаз окуу, зекет берүү, ажылык кылуу жана орозо кармоо” – деп хадисте келген.',
];

export default zaryiat55;
