const surahs = [
  {
    bismillah: 'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم',
    name: 'Ихлас Сүрөсү',
    arabic:
      'قُلْ هُوَ اللّٰهُ أَحَدٌ اللّٰهُ الصَّمَدُ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُۥ كُفُوًا أَحَدٌ',
    quran:
      '1. к̣уль-hувал-лааhу-ах̣ад 2. аллааhус̣-с̣амад 3. лям-йалид-ва-лям-йууляд 4. ва-лям-йакул-ляhуу-куфуван-ах̣ад ',
    transcription:
      'Мээримдүү, Ырайымдуу Аллахтын аты менен 1. Айткын2: Аллах Жалгыз! 2. Аллах эч кимге муктаж эмес! 3. (Ал) төрөбөгөн жана төрөлбөгөн! 4. Ага эч ким теңдеш эмес!',
  },
  {
    bismillah: 'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم',
    name: 'Фалак Сүрөсү',
    arabic:
      'قُلْ أَعُوذُ بِرَبِّ الْفَلَق مِنْ شَرِّ مَا خَلَقَ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ',
    quran:
      'Кул аъууз̃у бираббил фалак Мин шарри ма халак Уамин шарри гасикин из̃а уакаб Уамин шаррин наффас̃ати фиил ъукад Уамин шарри хасидин из̃а хасад',
    transcription:
      'Айткын: "Сактанам таңдын Эгеси менен; Ал жараткан нерселердин жамандыгынан; караңгылык каптагандагы анын жамандыгынан; түйүндөргө сыйкырлоочулардын кастыгынан; көрө албастардын кызгангандагы жамандыгынан”',
  },
  {
    bismillah: 'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم',
    name: 'Наас Сүрөсү',
    arabic:
      'قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ مَلِكِ ٱلنَّاسِ إِلَـٰهِ ٱلنَّاسِ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ مِنَ الْجِنَّةِ وَ النَّاسِ',
    quran:
      'Къул а’уузу би-рабби_н-наас(и) Малики_н-наас(и) Илааhи_н-нас(и) Мин шарри_л-васвааси_л-ханнаас(и) Ал-лазии ювасвису фии съудуури_н-наас(и) Мин альджиннати ва-н-наас(и)',
    transcription:
      'Айткын: "Сактанам адамдардын Эгеси менен; (Ал) адамдардын падышасы, (Ал) адамдардын Кудайы, Жашырынган азгыруучунун жамандыгынан; Ал адамдардын жүрөктөрүн азгырат. (Алар) жиндер жана адамдардан (болот)".',
  },
  {
    bismillah: 'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم',
    name: 'Филь Сүрөсү',
    arabic:
      'أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ تَرْمِيهِم بِحِجَارَةٍ مِّن سِجِّيلٍفَجَعَلَهُمْ كَعَصْفٍ مَّأْكُولٍ',
    quran:
      '1. алямм-таракяйфа-фаʿаля-раббукя-би-асх̣аабиль-фиииль 2. алям-йаджʿаль-кяййдаhумм-фии-таад̣лиииль 3. ва-арсаля-ʿалаййhим-т̣айран-абаабиииль 4. тармииhим-бих̣иджааратим-минн-сиджжиииль 5. фаджаʿаляhум-каʿас̣фим-маʾ-куууль',
    transcription:
      ' (О, Мухаммад!) Раббиң пил ээлерин эмне кылганын билбедиңби (Раббиң) алардын (Каабаны бузуп салуу үчүн ойлогон) айла-амалдарын текке кетирбедиби  Жана аларга каршы топ-топ куштарды жиберди (Куштар чеңгелиндеги) чопо-таштар менен аларды ташбараңга алышты (Аллаһ) аларды мойсолгон жалбырактай кылып койду',
  },
  {
    bismillah: 'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم',
    name: 'Курайш Сүрөсү',
    arabic:
      'لِإِيلَافِ قُرَيْشٍ إِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ الَّذِي أَطْعَمَهُم مِّن جُوعٍ وَآمَنَهُم مِّنْ خَوْفٍ',
    quran:
      '1. ли-ииляяфи-к̣урайййш  2. ииляяфиhим-рих̣латаш-шитааа-ивас̣с̣айййф 3. фальяʿбудуу-рабба-hааз̱аль-байййт  4. алляз̱иии-ат̣ʿамаhум-минн-джууʿив-ва-ааманаhум-мин-х̣ауууф',
    transcription:
      'Курайштын ынтымагы үчүн Кыш жана жай мезгилиндеги сапарында алардын ынтымак-тынчтыгы үчүн  Эми, алар (ар кандай таш-кудай, жыгач-кудайларын таштап, өздөрүнө ынтымак жашоо тартуулаган) ушул Үйдүн (Каабынын) Раббисине гана ибадат кылышсын  Ал (Рабби) каатчылыкта аларды тамактандырды жана коркунуч(тар)дан аман сактады ',
  },
  {
    bismillah: 'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم',
    name: 'Маун Сүрөсү',
    arabic:
      'أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ  فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ  وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ فَوَيْلٌ لِّلْمُصَلِّينَ الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ الَّذِينَ هُمْ يُرَاءُونَ وَيَمْنَعُونَ الْمَاعُونَ',
    quran:
      '1. ара-аййтал-ляз̱ии-йукяз̱з̱ибу-бид-дииин  2. фаз̱ааликял-ляз̱ии-йадуʿʿуль-йятииим 3. ва-ляя-йах̣уд̣д̣у-ʿаляя-т̣аʿаамиль-мискииин 4. фа-ваййлюль-лиль-мус̣аллииин 5. алляз̱иина-hум-ʿанн-с̣аляятиhим-сааhууун 6. алляз̱иина-hум-йурааа-ууун 7. ва-йамнаʿууналь-мааʿууун',
    transcription:
      '(О, Мухаммад)? сен динди «жалган» деген кишини көрдүң беле Мынаке ал, жетимди(н акысына кыянаттык кылып,) түрткүлөгөн адам  Жана ал жакырды тамактандырууга (элдерди) үгүттөгөн эмес  (Кээ бир) намаз окуучуларга азап-тозок болсун  Алар намаздарын унутуп коюшат Алар (намазда жана башка ибадаттарда) рия? кылышат Жана (муктаждардан) буюм-шаймандарды кызганышат',
  },
  {
    bismillah: 'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم',
    name: 'Каусар Сүрөсү',
    arabic:
      'إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ فَصَلِّ لِرَبِّكَ وَانْحَرْ  إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ',
    quran:
      '1. иннааа-аʿт̣аййнаакяль-кяус̱ар  2. фас̣алли-лираббикя-ванх̣ар 3. инна-шяяни-акя-hуваль-абтар',
    transcription:
      '(О, Мухаммад) чынында Биз сага «Каусарды» бердик.”  Сен эми, (ушул жакшылыктар үчүн шүгүр кылып) Раббиң үчүн намаз оку жана курмандык чал Албетте, сени айыптаган адамдын өзүнүн арты кесилген',
  },
  {
    bismillah: 'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم',
    name: 'Кафирун Сүрөсү',
    arabic:
      'قُلْ يَا أَيُّهَا الْكَافِرُونَ  لَا أَعْبُدُ مَا تَعْبُدُونَ وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ وَلَا أَنَا عَابِدٌ مَّا عَبَدتُّمْ وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ لَكُمْ دِينُكُمْ وَلِيَ دِينِ',
    quran: '',
    transcription:
      '(О, Мухаммад, каапырларга мындай) дегин: «Эй, каапырлар Менсилер ибадат кылган(кудайлар)га ибадат кылбаймын Силер дагы мен сыйынганга (Аллаһ Таалага) сыйынуучу эмессиңер Мен силер ибадат кылган кудайларга сыйынбаймын Силер да мен ибадат кылган(Аллаһ Таала)га ибадат кылуучу эмессиңер (Демек,) силерге өз диниңер, мага өз диним!»',
  },
  {
    bismillah: 'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم',
    name: 'Наср Сүрөсү',
    arabic:
      ' إِذَا جَاءَ نَصْرُ ٱللَّٰهِ وَ ٱلْفَتْحُ وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ ٱللَّٰهِ أَفْوَاجًا فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ ۗ إِنَّهُ كَانَ تَوَابًا',
    quran:
      'Иза Джа`а НасруЛлахи Уаль-Фатх. Уа Ра`айтан-Наса Йадхулюна Фи ДиниЛляхи Афуаджаа. Фасаббих Бихамди Раббика Уастагфирху Иннаху Кана Таууабаа.',
    transcription:
      '1. "Качан жардам жана жеңиш келген кезде 2. жана да динине топ-тобу менен кирип жаткан элдерди көргөнүңдө, 3. Ошондо Эгеңди мактоо менен даңктагын жана Андан кечирим сурагын. Албетте, Ал тооболорду кабыл кылуучу!',
  },
  {
    bismillah: 'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم',
    name: 'Масад Сүрөсү',
    arabic:
      'تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ مَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَسَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍوَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ فِي جِيدِهَا حَبْلٌ مِّن مَّسَدٍ',
    quran:
      ' 1. таббат-йадааа-абииляhабив-ватабб  2. мааа-аг̣наа-ʿанhу-мааляhуу-вамаакясаб  3. сайас̣лаа-нааранн-з̱аата-ляhаб 4. вамра-атуhуу-х̣аммаа-ляталь-х̣атаб 5. фии-джиидиhаа-х̣аблюм-мим-масад',
    transcription:
      'Абу Лахабдын эки колу (өзү) куурап калсын! Куурап да калды   Ага мал- дүйнөсү да, бала-чакасы да пайда берген жок Ал жакында алоолонгон Тозокко ташталат  Ал эми (Пайгамбарга каршы доомат - ушак көтөрүп жүргөн) анын аялы болсо (наркы дүйнөдө) отун көтөргөн абалда Анын мойнунда (тозоктогу) курма дарагынын буласынан (эшилген) жип',
  },
];

export default surahs;
