import React from 'react';
import Header from '../components/Header';
import Welcome from '../components/Welcome';
import Footer from '../components/Footer';
import { Typography, Container } from '@mui/material';

const Hutba = () => {
  return (
    <div>
      <Header />
      <Welcome />
      <Container sx={{ mt: 4, mb: 4, textAlign: 'center' }}>
        <Typography
          variant="h3"
          sx={{
            mb: 2,
            textAlign: 'center',
            fontWeight: 'bold',
            fontSize: {
              xs: 'h5.fontSize',
              sm: 'h4.fontSize',
            },
          }}
        >
          Пайгамбарыбыз Мухаммад саллаллаху алейхи вассаламдын <br /> акыркы
          хутбасы
        </Typography>
        <Typography
          variant="body1"
          sx={{ lineHeight: 1.6, whiteSpace: 'pre-wrap' }}
        >
          ... Эй, адамдар! Сөзүмдү жакшылап тындагыла! Билбеймин, балким бул
          жылдан кийин силер менен бул жерде кайра кездеше албас чыгармын. Эй,
          адамдар! Ушул күнүңөр канчалык касиеттүү болсо, бул айыңар канчалык
          касиеттүү ай болсо, бул калааңар (Мекке) кандай касиеттүү калаа болсо,
          жаныңар, малыңар, намысыңар да ошондой касиеттүү. Ap түрдүү
          карасанатайлыктан корголгон. Сахабаларым! Эртең Раббиңер менен
          жолугасыңар жана бүгүнкү бардык иш- аракеттерден милдеттүү түрдө
          эсепке тартыласыңар. Менден кийин мурунку бузукулуктарыңарга кайтып,
          бири-бириңерди өлтүрбөгүлө. Бул осуятымды ушул жердегилер бул жерде
          болбогон адамдарга жеткирсин. Уккан адам бул жерде болуп уккан адамдан
          да жакшы түшүнүп, эсинде сактоосу мүмкүн.Сахабаларым! Кимде бирөөнүн
          аманаты бар болсо аны ээсине кайтарсын. Пайыздын бардык түрү жоюлган.
          бутумдун астында. Бирок, карызынардын негизгисин берүүнөр керек.
          Зулумдук кылбагыла, зулумдукка учурабагыла. Аллах тааланын буйругу
          менен пайызга эми тыйуу салынды. Жахилдик доорунан калган бул жаман
          адаттын бардыгы бутумдун астында. Биринчи жойгон пайыз -
          Абдулмутталибдин уулу (агам) Аббастын пайызы. Сахабаларым! Жахилдик
          доордогу кан доолор да толугу менен жоюлду. Жойгон алгачкы кан доом -
          Абдулмутталибдин небереси Рабианын кан доосу. Эй, Адамдар! Каалаган
          убакта согушуу үчүн кан төгүү арам болгон айлардын орундарын
          алмаштыруу - күфүрлүктүн дал өзү. Бул - капырлардын чон адашуучулукка
          түшкөн нерсеси. Алар бир жылы адал деп кабылдаган бир айды келерки
          жылы арам деп жарыялашты. Хак тааланын адал жана арам кылгандарынын
          санына шай кылабыз деп ушундай кылышты. Алар Аллах тааланын арам
          кылганын адал, ал эми адал кылганын арам кылышат. Күмөнсүз, убакыт -
          Аллах тааланын жараткан күнүндөгү түр менен тартипке түштү. Эй,
          адамдар! Бүгүн шайтан силердин бул жериңерде жаңыдан бийлигин жүргүзүү
          жана үстөмдүк куруу күчүнөн түбөлүккө айрылды. Бирок, силер ушул
          жойгон нерселеримен башка кичине деп эсептеген нерсенерде ага баш ийе
          турган болсоңор бул аны кубантат. Диниңерди коргоо үчүн булардан да
          сактангыла! Эй, адамдар! Аялдардын укуктарын урматтоону жана ушул
          маселеде Аллах тааладан коркууңарды сунуштайм. Силер аялдарды Аллах
          тааланын аманаты катары алдыңар, алардын намысы менен арын Аллах
          тааланын аты менен убада берип, адалдыкка алдыңар. Силердин аялдардагы
          укуктарыңар, алардын силерде укуктары бар. Силердин аялдардагы
          укутарыңар - алардын үй-бүлөлүк махрамдыкты силер жактырбаган эч кимге
          таптатпоосу. Эгер силер жактырбаган бирөөнү үйгө киргизсе аларды жеңил
          уруу менен жазаландырып мындан сактандырсаңар болот. Аялдардын
          силердеги укуктары - аларга адал кол менен ар турдуу даам менен
          кийим-кечектерин камсы з кылууларынар. Эй, момундар! Силерге бир
          аманат калтырамын, аны жакшылап кармасаңар жолуңардан адашпайсыңар. Ал
          аманат - Аллах тааланын китеби Курани карим (Башка риваяттарда
          «сүннөтүм» жана «ахли байтим» деп көрсөтүлгөн). Эй, момундар! Сөзүмдү
          жакшылап тыңдагыла жана эсиңерге жакшылап сактагыла. Мусулман
          мусулмандын бир тууганы, ушундайча бардык мусулмандар бири-бирине бир
          тууган. Дин бир тууганыңардын жаны, каны, мал-мүлкү, ар-намысы жана
          акысына сурабай кол салуу эч кимге адал эмес. Бир гана өзү көңүл
          ыраазылыгы менен берсе гана адал болмокчу. Сахабаларым! Өзүңөргө
          зулумдук кылбагыла! Мойнуңарда өзүңөргө да тийиштүү сактоого тийиш
          болгон укуктарыңар, жоопкерчиликтериңер бар. Эй, адамдар! Аллах таала
          ар бир укук ээсине укугун (Курани каримде) берген. Мураскордун,
          осуяттын кажети жок. Бала кимдин төшөгүндө туулса ошого тийиштүү.
          Зынакорлук кылган адамга махрумдук бар. Өзүн атасынан башканын
          тегиненмин деп айткан тексиздер же өз кожоюнунан качып башканын колуна
          баш калкалаган нанкөр адам Аллах таланын азабына, периштелер менен
          бардык мусулмандардын каргышына учурасын. Хак таала мындай адамдардын
          тооболорун да, Күбөлуктөрүн да кабыл кылбайт. Эй, адамдар! Раббиңер
          бир. Атаңар да бир. Баарынар Адамдын балдарысыңар. Адам болсо
          топурактан жаратылды. Аллахтын алдында эң кадырлууңар - эң такыбаа
          болгонуңар. Араптын арап эместерден артыкчылыгы жок. Артыкчылык бир
          гана такыбаада. Эй, адамдар! Эртең силерден мен тууралуу сурашат, эмне
          дейсиңер?» Ушул кезде Расулуллах ыйык сөөмөйүн көтөрүп, жамаатка
          каратып: «Күбө бол, йа, Раб! Күбө бол, йа, Раб! Күбө бол, йа, Раб!» -
          деди. Пайгамбарыбыз Вада хутбасын окуган күнү «.....» сүрөсүнүн «Бүгүн
          диниңерди силер үчүн толуктадым. Силерге деген ниматымды аяктадым жана
          силерге дин катары Исламды берүүгө ыраазы болдум» деген маанидеги 3-чу
          аяты түштү. Пайгамбарыбыз бул аятты сахабаларына окуган кезде Абу Бакр
          ыйлап жиберди. Сахабалар анын себебин сураганда: «Бул аяти карима
          Расулуллахтын кайтыш боло турчу убактысынын жакындаганын керсөтүп
          турат. Ошол учун ыйлап жатам», - деди.
        </Typography>
      </Container>
      <Footer />
    </div>
  );
};

export default Hutba;
