import React from 'react';
import Header from '../components/Header';
import Welcome from '../components/Welcome';
import Footer from '../components/Footer';
import { Typography, Container } from '@mui/material';

const Hutba = () => {
  return (
    <div>
      <Header />
      <Welcome />
      <Container sx={{ mt: 4, mb: 4, textAlign: 'center' }}>
        <Typography
          variant="h3"
          sx={{
            mb: 2,
            textAlign: 'center',
            fontWeight: 'bold',
            fontSize: {
              xs: 'h5.fontSize',
              sm: 'h4.fontSize',
            },
          }}
        >
          Пайгамбарыбыз Мухаммад саллаллаху алейхи вассаламдын <br /> акыркы
          хутбасы
        </Typography>
        <Typography
          variant="body1"
          sx={{ lineHeight: 1.6, whiteSpace: 'pre-wrap' }}
        >
          ... Эй, адамдар! Сезумду жакшылап тындагыла! Билбеймин, балким бул
          жылдан кийин силер менен бул жерде кайра кездеше албас чыгармын. Эй,
          адамдар! Ушул кунунер канчалык касиетту болсо, бул айынар канчалык
          касиеттуу ай болсо, бул калаанар (Мекке) кандай каисеттуу калаа болсо,
          жанынар, малынар, намысынар да ошондой касиеттуу. Ap турдуу
          карасанатайлыктан корголгон. Сахабаларым! Эртен Раббинер менен
          жолугасынар жана бугунку бардык иш- аракеттерден милдеттуу турде
          эсепке тартыласынар. Менден кийин мурунку бузукулуктарынарга кайтып,
          бири-биринерди елтурбегуле. Бул осуятымды ушул жердегилер бул жерде
          болбогон адамдарга жеткирсин. Уккан адам бул жерде болуп уккан адамдан
          да жакшы тушунуп, эсинде сактоосу мумкун.Сахабаларым! Кимде биреенун
          аманаты бар болсо аны ээсине кайтарсын. Пайыздын бардык туру жоюлган.
          Бутумдун астында. Бирок, карызынардын негизгисин беруунер керек.
          Зулумдук кылбагыла, зулумдукка учурабагыла. Аллаху тааланын буйругу
          менен пайызга эми тыйуу салынды. Жахилдик доорунан калган бул жаман
          адаттын бардыгы бутумун астында. Биринчи жойгон пайыз -
          Абдулмутталибдин уулу (агам) Аббастын пайызы. Сахабаларым! Жахилдик
          доордогу кан доолор да толугу менен жоюлду. Жойгон алгачкы кан доом -
          Абдулмутталибдин небереси Рабианын кан доосу. Эй, Адамдар! Каалаган
          убакта согушуу учун кан тегуу харам болгон айлардын орундарын
          алмаштыруу - куфурлуктун дал езу. Бул - капырлардын чон адашуучулукка
          тушкен нерсеси. Алар бир жылы адал деп кабылдаган бир айды келерки
          жылы харам деп жарыялашты. Хак тааланын халал жана харам кылгандарынын
          санына шай кылабыз деп ушундай кылышты. Алар Аллаху тааланын харам
          кылганын халал, ал эми халал кылганын харам кылышат. Куменсуз, убакыт
          - Аллаху тааланын жараткан кунундегу тур менен тартипке тушту. Эй,
          адамдар! Бугун шайтан силердин бул жеринерде жаныдан бийлигин жургузуу
          жана устемдук куруу кучунен тубелукке айрылды. Бирок, силер ушул
          жойгон нерселеримен башка кичине деп эсептеген нерсенерде ага баш ийе
          турган болсонор бул аны кубантат. Дининерди коргоо учун булардан да
          сактангыла! Эй, адамдар! Аялдардын укуктарын урматтоону жана ушул
          маселеде Аллаху тааладан коркуунарды сунуштайм. Силер аялдарды Аллаху
          тааланын аманаты катары алдынар, алардын намысы менен арын Аллаху
          тааланын аты менен убада берип, халалдыкка алдынар. Силердин
          аялдардагы укуктарыныар, алардын силерде укуктары бар. Силердин
          аялдардагы укутарынар - алардын уй-булелук махрамдыкты силер
          жактырбаган эч кимге таптатпоосу. Эгер силер жактырбаган биреену уйге
          киргизсе аларды женил уруу менен жазаландырып мындан сактандырсанар
          болот. Аялдардын силердеги укуктары - аларга халал кол менен ар турдуу
          даам менен кийим-кечектерин камсы з кылууларынар. Эй, момундар!
          Силерге бир аманат калтырамын, аны жакшылап кармасанар жолунардан
          адашпайсынар. Ал аманат - Аллаху тааланын китеби Курани карим (Башка
          риваяттарда «суннетум» жана «ахли байтим» деп корсетулген). Эй,
          момундар! Сезумду жакшылап тындагыла жана эсинерге жакшылап сактагыла.
          Мусулман мусулмандын бир тууганы, ушундайча бардык мусулмандар
          бири-бирине бир тууган. Дин бир тууганынардын жаны, каны, мал-мулку,
          ар- намысы жана акысына сурабай кол салуу эч кимге халал эмес. Бир
          гана езу кенул ыраазылыгы менен берсе гана халал болмокчу.
          Сахабаларым! Озунерге зулумдук кылбагыла! Мойнунарда езунерге да
          тийиштүү сактоого тийиш болгон укуктарынар, жоопкерчиликтеринер бар.
          Эй, адамдар! Аллаху таала ар бир укук ээсине укугун (Курани каримде)
          берген. Мураскордун, осуяттын кажети жок. Бала кимдин тешегунде туулса
          ошого тийиштүү. Зинакорлук кылган адамга махрумдук бар. Озун атасынан
          башканын тегиненмин деп айткан тексиздер же ез кожоюнунан качып
          башканын колуна баш калкалаган нанкер адам Аллаху таланын азабына,
          периштелер менен бардык мусулмандардын каргышына учурасын. Хак таала
          мындай адамдардын тооболорун да, Күбөлуктөрун да кабыл кылбайт. Эй,
          адамдар! Раббинер бир. Атанар да бир. Баарынар Адамдын балдарысынар.
          Адам болсо топурактан жаратылды. Аллахтын алдында эн кадырлуунар - эн
          такыбаа болгонунар. Араптын арап эместерден артыкчылыгы жок.
          Артыкчылык бир гана такыбаада. Эй, адамдар! Эртен силерден мен
          тууралуу сурашат, эмне дейсинер?» Ушул кезде Расулуллах ыйык сеемейун
          кетеруп, жамаатка каратып: «Күбө бол, йа, Раб! Күбө бол, йа, Раб! Күбө
          бол, йа, Раб!» - деди. Пайгамбарыбыз Вада хутбасын окуган куну «Манда»
          суресунун «Бугун диницерди силер учун толуктадым. Силерге деген
          ниматымды аяктадым жана силерге дин катары Исламды берууге ыраазы
          болдум» деген маанидеги 3-чу аяты тушту. Пайгамбарыбыз бул аятты
          сахабаларына окуган кезде Абу Бакр ыйлап жиберди. Сахабалар анын
          себебин сураганда: «Бул аяти карима Расулуллахтын кайтыш боло турчу
          убактысынын жакындаганын керсетуп турат. Ошол учун ыйлап жатам», -
          деди.
        </Typography>
      </Container>
      <Footer />
    </div>
  );
};

export default Hutba;
