import { Container, Typography, Box } from '@mui/material';
import Header from './Header';

const Islam = () => {
  return (
    <>
      <Header />
      <Container maxWidth="md" style={{ marginTop: '80px' }}>
        <Box textAlign="center" mb={3}>
          <Typography variant="h5" component="h1" gutterBottom>
            Ислам деген эмне ?
          </Typography>
        </Box>
        <Box
          sx={{
            backgroundColor: '#efe1b2a0',
            padding: 3,
            borderRadius: 2,
          }}
        >
          <Typography
            variant="body1"
            sx={{
              lineHeight: '1.5',
              textAlign: 'left',
              color: '#333',
            }}
          >
            Аллаху тааланын Жабраил периште аркылуу сүйүктүү жана акыркы
            пайгамбары Мухаммед алейхиссаламга жиберген дини Ислам деп аталат.
            Ислам - адамдардын дүйнөдө тынчтык жана эркиндикте жашап, акыретте
            түбөлүк бакытка жетүүлөрүн камсыз кылуучу эрежелердин жыйынтыгы.
            Эски диндердеги бардык жакшы касиеттерди Ислам дини өзүнө камтыган.
            Бардык бакыт жана жакшылыктар ошондо. Ислам - аң-сезимдүү адам
            сөзсүз кабыл ала турган негиздер жана руханий маанилүү нерселерден
            турат. Жаратылышында тазалык болгон адамдар Исламга душман
            болушпайт. Исламдын ичинде эч кандай зыяндуулук жок. Анын сыртында
            да эч кандай пайда жок. Ислам адамдарды бири-бирин сүйүүгө,
            бири-бири менен жардамдашууга, бир туугандардай өмүр сүрүүгө
            чакырат. Мамлекеттерди өнүктүрүүнү, адамдардын руханий, дене жана
            пикир жагынан эркин жашоолорун каалайт. Аллаху тааланын буйруктарын
            урматтоону, бардык жандууларга мээримдүү болууну буюрган. Ислам
            жандуу-жансыз ар бир жаратылганга карата жоопкерчиликти жүктөгөн.
            Ушуну менен катар, адам напсинин бардык ыпластыктардан арылуусун
            камсыздайт. Жаман көнүмүш адаттардан алыстап, напсини тарбиялоого
            чакырат. Жалкоолукка, убакытты текке кетирүүгө тыюу салып, билимге,
            техникага, өнөрчүлүккө, соодага, дыйканчылыкка, өндүрүшкө өтө чоң
            маани берет. Дини, мекени жана ишеними башка адамдарга каршы күч
            көрсөтүүгө тыюу салат. Жеке адамдын, коомдордун жана улуттардын
            укуктары жана милдеттерин так көрсөтөт. Тирүүлөргө, өлгөндөргө,
            туула тургандарга, баарына өзүнө тийиштүү укук жана
            жоопкерчиликтерди жүктөөдө. Ислам дини адамзаттын эки дүйнөдө тең
            бактылуу болуусун көздөйт. Башка диндердин негизи өзгөртүлүп, диний
            өкүмдөрдүн ордуна адамдар ойлоп чыгарган пикирлер орун алган. Аллаху
            таала адамдардын дүйнөдө тынчтык жана эркиндикте жашап, акыретте
            түбөлүк бакытка жетүүлөрүн каалайт. Ошондуктан, бакытка жеткире
            турчу пайдалуу нерселерди жасоону буюрган. Зыяндуу нерселерге тыюу
            салат. Динге ишенсин-ишенбесин, каалаган бир адам билип же билбей
            Аллаху тааланын буйруктарына моюн сунса дүйнөдө ыракат өмүр сүрөт.
            Азыркы учурда динсиз адамдардын жана улуттардын бир топ иштерде
            өнүгүүлөрүнүн себеби, Ислам дининде айтылгандай аракет
            кылгандыктарына байланыштуу болууда. Ал эми, акыретте бактылуу болуу
            үчүн Ислам динине ишенип, ыйман келтирүүлөрү да кажет. Ислам үч
            негиз: илим, амал, жана ыкыластан турат. Б.а., Ислам ту-уралуу билим
            алуу, үйрөнгөндөрүн орундоо, кылган бардык амалдарын бир гана
            Аллахтын ыраазычылыгы үчүн жасоо керек. Ислам - ыйман илими, фикх
            илими, калб (көңүл-жүрөк) илимдери болуп үчкө бөлүнөт. Мусулман адам
            ыйман илимин Ахли сүннөт аалымдарынын китептеринен үйрөнөт. Амал
            илимин төрт мазхабдын фикх китептеринен үйрөнөт. Ахли сүннөт
            аалымдары бул илимдерди сахабалардан үйрөнүшкөн. Ал эми, сахабалар
            Пайгамбарыбыздан үйрөнүшкөн. <br /> Ислам дини китебинен.
          </Typography>
        </Box>
      </Container>
    </>
  );
};

export default Islam;
