import React, { useState, useEffect } from 'react';

const Section4 = () => {
  const [textIndex, setTextIndex] = useState(0);
  const texts = [
    'Аллах Таала Куранда: «Чындыгында, намаз бузукулуктан жана күнөөдөн тосот» - деп айткан. (Анкабут. 45-аят).',
    'Аллах Таала айткан: "Албетте намаз ыймандуу адамдар үчүн өз убактысында окулуучу парз болду". (Ниса, 103-аят).',
    'Аллах Таала Куранда: “Алар чыныгы динди таза, бекем кармап, бир гана Аллахка сыйынууга жана намаз окуп зекет берүүгө буюрулду” - деген. (Баййина. 5-аят).',
    'Аллах Таала: “Намаз окугула, зекет бергиле...” - деп айткан. (Бакара. 43-аят).',
    'Аллах Таала Куранда: «Оо, ыймандуулар, Жума күнү намазга азан айтылганда Аллахты эскерүүгө (намаз окууга) шашылгыла…» - деген. (Жума. 9-аят).',
    'Аллах Таала айткан: «Бирок алардын артынан намаздарын таштаган жана кумарларына ээрчиген урпактар келди. Ошондуктан алар жамандыкка кабылышат». (Марьям, 59-аят).',
    'Аллах Таала айткан: «Силерди (бул) сакарга (тозокко) эмне алып келди (дешет). Алар жооп беришет: Биз намаз окугандардан эмес элек». (Муддасир,42-аят).',
    'Аллах Таала айткан: «Вайл (тозок) болсун намазды (начар) окуучуларга. Анткени алар намаздарын унутуп коюшкан. Алар (намаздарын) эл көрсүн үчүн окушат». (Маауун, 4-5-аяттар).',
    '“Ислам беш нерсе менен негизделген: Аллахтан башка сыйынууга татыктуу зат (илах) жок, Мухаммад Анын элчиси деп күбөлүк берүү, намаз окуу, зекет берүү, ажылык кылуу жана орозо кармоо”– деп айткан.',
  ];
  const colors = ['#f0f0f0', '#c0c0c0', '#a0a0a0'];

  useEffect(() => {
    const interval = setInterval(() => {
      setTextIndex((prevIndex) => (prevIndex + 1) % texts.length);
    }, 5000);

    return () => clearInterval(interval);
  }, [texts.length]);

  return (
    <div
      style={{
        backgroundColor: colors[textIndex % colors.length],
        marginTop: '20px',
        display: 'flex',
        flexDirection: 'column',
        alignItems: 'center',
        justifyContent: 'center',
        minHeight: '200px',
        transition: 'background-color 0.5s ease',
        padding: '20px',
        borderRadius: '8px',
        boxShadow: '0px 4px 10px rgba(0, 0, 0, 0.1)',
      }}
    >
      <h2 style={{ textAlign: 'center', color: '#333' }}>
        وَذَكِّرْ فَإِنَّ الذِّكْرَىٰ تَنْفَعُ الْمُؤْمِنِينَ
      </h2>

      <div style={{ textAlign: 'center', fontSize: '1.5rem', color: '#555' }}>
        {texts[textIndex]}
      </div>
      <h3>
        "ЭСКЕРТКИН,- ЭСКЕРТҮҮ МОМУНДАРГА ПАЙДА БЕРЕТ" (ЗАРИЯТ СҮРӨСҮ 55 АЯТ).
      </h3>
    </div>
  );
};

export default Section4;
