import { Typography, Container, Box } from '@mui/material';
import Header from '../../Header';
import Welcome from '../../Welcome';
import meccabackground from '../../../assetts/images/islam/mecca.jpg'; // Фоновое изображение

const Ajylyk = () => {
  return (
    <div>
      <Header />
      <Welcome />
      <Box
        sx={{
          backgroundImage: `url(${meccabackground})`, // Фоновое изображение
          backgroundSize: 'cover', // Масштабирование, чтобы покрыть весь блок
          backgroundPosition: 'center', // Центрирование изображения
          backgroundRepeat: 'no-repeat', // Отключение повторения
          minHeight: '100vh', // Минимальная высота, чтобы покрыть весь экран
          py: 4, // Отступы по вертикали
        }}
      >
        <Container>
          <Box
            sx={{
              textAlign: 'center', // Выравнивание текста по центру
              bgcolor: 'rgba(234, 227, 196, 0.917)', // Полупрозрачный фон
              borderRadius: 2, // Закругленные углы
              p: 4, // Отступы внутри контейнера
              mb: 4, // Отступ снизу
            }}
          >
            <Typography
              variant="h3"
              component="h1"
              gutterBottom
              sx={{ textAlign: 'center' }}
            >
              Ажылык
            </Typography>
            <Typography
              variant="body1"
              component="div"
              paragraph
              sx={{ textAlign: 'center' }}
            >
              Ажылык деген эмне? Ажылыктын сөздүк мааниси – улуу нерсеге карай
              аттануу. Шарият боюнча ажылык бул – Кааба жана анын айланасындагы
              куттуу деп эсептелген белгилүү жерлерге белгиленген учурда барып,
              усул-эрежелерине ылайык зарыл ибадаттарды аткаруу болуп эсептелет.
            </Typography>
            <Typography
              variant="body1"
              component="div"
              paragraph
              sx={{ textAlign: 'center' }}
            >
              Аллах Таала өз пенделерине эгер мүмкүнчүлүгү болсо, өмүрүндө бир
              жолу хаж ибаадатын парз кылды. Хаж- бул Аллах Субхану уа Тааланын
              үйү болгон ыйык Каабаны, эң биринчи мусулманчылык башталган,
              Кураан аяттары түшкөн жерди, Пайгамбарыбыз (салаллоху алейхи уа
              салламдын) баскан жерлерин, анын мечитин, сахабалар мекендеген
              жерди зыярат кылуу. Ар кандай нерсени угуп койгон башка, бирок көз
              менен көргөн башка таасир берет. Ошол сыңары, Ыйык Кураандын
              мекенин, Пайгамбарыбыз (салаллоху алейхи уа саллам) үммөтү үчүн
              азап чексе да, сабыр кылуу менен туура жолду баштап, басып өткөн
              жерлерди зыярат кылуу менен, пенденин Аллах Таалага, Пайгамбарыбыз
              (салаллоху алейхи уа салламга) болгон сүйүүсү, арзуусу жогорулап,
              ыйманы ого бетер бекемделет ин шаа Аллах. Ошону менен катар Хажда
              кылынган ибаадаттардын сооптору, башка мезгилде кылынган
              ибадаттардын сообунан бир канча эсе көп болот. Жогоруда айтылган
              беш парздын эч биринде пенде үчүн кыйынчылык жаратылган эмес,
              тескерисинче, ар биринде Жараткандын нематы, пендесине болгон
              камкордугу, берешендиги, чексиз жакшылыктары, эки дүйнөнүн
              бактылуугу камтылган.
            </Typography>
          </Box>
        </Container>
      </Box>
    </div>
  );
};

export default Ajylyk;
