import { Typography, Box } from '@mui/material';
import React from 'react';
import BackgroundImage from '../../../assetts/images/islam/shahadaimg.jpg'; // Путь к фоновому изображению
import Header from '../../../components/Header';
import Welcome from '../../../components/Welcome';

const Orozo = () => {
  return (
    <div>
      <Header />
      <Welcome />
      <Box
        sx={{
          padding: 3,
          backgroundColor: '#f9f9f9',
          backgroundImage: `url(${BackgroundImage})`, // Фоновое изображение
          backgroundSize: 'cover', // Масштабирование, чтобы покрыть весь блок
          backgroundPosition: 'center', // Центрирование изображения
          backgroundRepeat: 'no-repeat', // Отключение повторения
          boxShadow: '0 2px 5px rgba(0,0,0,0.1)',
        }}
      >
        <Box
          sx={{
            backgroundColor: 'rgba(255, 255, 255, 0.8)', // Полупрозрачный фон для текста
            padding: 3,
            borderRadius: 2,
            boxShadow: '0 2px 5px rgba(0,0,0,0.2)',
            textAlign: 'center', // Выравнивание текста по центру
          }}
        >
          <Typography
            variant="body1"
            component="p"
            sx={{ lineHeight: 1.6, color: '#555', marginBottom: 2 }}
          >
            Теңдикти сүйгөн Аллах Субхану уа Таала бир жылда бир жолу Рамазан
            айында 30 күн орозо кармоону парз кылды. Муну менен Ал ачкалык эмне
            экенин билбеген пенделерине, жегенге эч нерсеси жок, күндөп- түндөп
            ачка жүргөн мусулман бир туугандарынын акыбалын ар бир инсан өзү
            сезип, билип көрсүн, ачка болгондо тамактын, суусаганда суунун
            кадырын билүүгө үндөдү. Ошондой эле, орозо менен Аллах Таала пендени
            сабырдуулука үйрөтөт. Инсан орозо кармоо менен жүрөгү жумшарат,
            барга да, жокко да сабыр кылууну үйрөнөт. Кураанда “Аллах
            сабырдууларды сүйөт” (Аалу Имран: 146) деген аят келет. Орозодо
            Аллах Тааламдын пендесине берген убадасы бар. Анткени, “Орозону
            пендем мен үчүн кармайт, ошондуктан анын сыйлыгын Өзүм берем” деген.
            Ошондой эле орозо кармагандар үчүн чексиз Берешен Аллах Таала
            Бейиште атайын “РАЙЙАН” эшигин ачып койду. Ал үчүн чексиз шүгүрлөр
            болсун!
          </Typography>

          <Typography
            variant="body1"
            component="p"
            sx={{ lineHeight: 1.6, color: '#555', marginBottom: 2 }}
          >
            Ошондой эле, азирети Пайгамбарыбыз өзүнүн хадистеринде орозонун парз
            экендигин көп кайталаган. Абу Хурайрадан (Алла ыраазы болсун)
            рабаят: "Пайгамбарыбыз айтты: "Силерге берекелүү Рамазан айы келди.
            Алла (азза ва жалла) силерге ал айдын орозосун кармоону парз кылды.
            Ал айда бүт асман эшиктери ачылат. Тозок эшиктери жабылат. Анда
            бейбаш шайтандар кишенделет. Ал айда Алланын миң айдан жакшыраак бир
            түнү бар. Ким ошол түндүн жакшылыгына жетише албаса, анда бардык
            жакшылыктардан кур жалак калыптыр". Имам Термизий жана Имам Ибну
            Маажа рабаяты.
          </Typography>
        </Box>
        <Box
          sx={{
            display: 'flex',
            justifyContent: 'center',
            marginTop: 3,
          }}
        ></Box>
      </Box>
    </div>
  );
};

export default Orozo;
