import { Typography, Box } from '@mui/material';
import React from 'react';
import BackgroundImage from '../../../assetts/images/islam/shahadaimg.jpg'; // Путь к фоновому изображению
import Header from '../../../components/Header';
import Welcome from '../../../components/Welcome';

const Orozo = () => {
  return (
    <div>
      <Header />
      <Welcome />
      <Box
        sx={{
          padding: 3,
          backgroundColor: '#f9f9f9',
          backgroundImage: `url(${BackgroundImage})`, // Фоновое изображение
          backgroundSize: 'cover', // Масштабирование, чтобы покрыть весь блок
          backgroundPosition: 'center', // Центрирование изображения
          backgroundRepeat: 'no-repeat', // Отключение повторения
          boxShadow: '0 2px 5px rgba(0,0,0,0.1)',
        }}
      >
        <Box
          sx={{
            backgroundColor: 'rgba(255, 255, 255, 0.8)', // Полупрозрачный фон для текста
            padding: 3,
            borderRadius: 2,
            boxShadow: '0 2px 5px rgba(0,0,0,0.2)',
            textAlign: 'center', // Выравнивание текста по центру
          }}
        >
          <Typography
            variant="body1"
            component="p"
            sx={{ lineHeight: 1.6, color: '#555', marginBottom: 2 }}
          >
            Орозо деген эмне? Орозо араб тилинде: "Сыям" - деп аталып, сөздүктө
            бир нерседен өзүн тыюну билдирет. Шарият термининде: "Орозо таң
            жүргөндөн баштап, күн батканга чейин ниет менен орозону ачуучу
            нерселерден өзүн тыюу" - дегенди түшүндүрөт. Орозону бузуучу
            нерселер дегенде жеп-ичүү, жыныстык катнаш кылуу.
          </Typography>
          <Typography
            variant="body1"
            component="p"
            sx={{ lineHeight: 1.6, color: '#555', marginBottom: 2 }}
          >
            Рамазан айынын орозосун кармоо экинчи хижрий жылда парз кылынган.
            Экинчи хижрий жылдын Шаабан айында, хижраттан он сегиз ай өткөндөн
            соң жана кыбыла Каабага бурулгандан кийин парз кылынган. Анын себеби
            айдын келүүсү. Анткени аны Рамазан айына таандык кылынат жана айдын
            кайталануусу менен орозонун парздыгы да кайталанат.
          </Typography>
          <Typography
            variant="body1"
            component="p"
            sx={{ lineHeight: 1.6, color: '#555', marginBottom: 2 }}
          >
            Рамазандын ар бир күнүнүн жаңылануусу анын кармалуусуна себеп болот.
            Рамазан айынын орозосун кармоо Куран, сүннөт жана ижма менен бекем
            болгон. Алла Таала Бакара сүрөөсүндө: "Эй ыйман келтиргендер, такыба
            болууңар үчүн силерге силерден мурунку өткөндөргө парз кылынгандай
            орозо кармоо парз кылынды". (183-аят). "Рамазан айы, бул айда
            адамдарга туура жол болуп, ушул туура жолдун жана жакшы менен
            жаманды ажыратуучунун ачык далилдери болуп Куран түшүрүлдү. Силерден
            ким ушул айга күбө болсо, анда, орозосун кармасын" (185-ааят).
          </Typography>
          <Typography
            variant="body1"
            component="p"
            sx={{ lineHeight: 1.6, color: '#555', marginBottom: 2 }}
          >
            Ошондой эле, азирети Пайгамбарыбыз өзүнүн хадистеринде орозонун парз
            экендигин көп кайталаган. Абу Хурайрадан (Алла ыраазы болсун)
            рабаят: "Пайгамбарыбыз айтты: "Силерге берекелүү Рамазан айы келди.
            Алла (азза ва жалла) силерге ал айдын орозосун кармоону парз кылды.
            Ал айда бүт асман эшиктери ачылат. Тозок эшиктери жабылат. Анда
            бейбаш шайтандар кишенделет. Ал айда Алланын миң айдан жакшыраак бир
            түнү бар. Ким ошол түндүн жакшылыгына жетише албаса, анда бардык
            жакшылыктардан кур жалак калыптыр". Имам Термизий жана Имам Ибну
            Маажа рабаяты.
          </Typography>
          <Typography
            variant="body1"
            component="p"
            sx={{ lineHeight: 1.6, color: '#555' }}
          >
            Ислам үммөтү дайыма Рамазандын орозосу парз экендигине бир пикирде
            болуп келген. Жогоруда орозо араб тилинде: "Сыям" - деп аталып, анын
            сөздүктөгү жана шарияттагы маанилери айтылды. Мухтасарул викоя
            китебинде: "Орозо таң жүргөндөн күн батканга чейин ниет менен
            жеп-ичүүнү жана жыныстык катнашты таштоо" - деп айтылган. Ал эми
            этек кир жана төрөттөн кийинки канды көрүп жаткан аялдарга орозо
            парз эместиги ачык айтылган.
          </Typography>
          <Typography
            variant="body1"
            component="p"
            sx={{ lineHeight: 1.6, color: '#555' }}
          >
            Таңдан максат жайылган чын таң эске алынат. Орозонун парздыгы күн
            батканга чейин экендиги Курандын: "Андан кийин орозону кечке чейин
            толук кылгыла",- деген аятынан алынган. Орозого жана башка
            ибадаттарга ниетти шарт кылуу, адатта ибадаттарды бир-биринен
            айырмалоо үчүн болгон. Ошондой эле жөнөкөй амалды ибадатка
            айландыруу үчүн да ниет шарт. Демек ар бир жакшы иш ниет менен
            ибадатка айланат. Жогоруда өкүмдөрү түшүнтүрүлгөн Рамазан айынын
            орозосун кармоо акыл-эси жайында болгон балакатка жеткен жана башка
            шарттарды өз ичине алган момун мусулмандарга парз.
          </Typography>
        </Box>
        <Box
          sx={{
            display: 'flex',
            justifyContent: 'center',
            marginTop: 3,
          }}
        ></Box>
      </Box>
    </div>
  );
};

export default Orozo;
